import icon from "../assets/img/cbc_icon.svg";

export default function About() {
  return (
    <div className="grid grid-cols-5 gap-6 p-4" dir="rtl">
      <div className="col-span-6 lg:col-span-3">
        <h1 className="font-suhayb text-2xl my-5">لەبارەی ئێمە</h1>
        <h1 className="text-gray-700 font-suhayb text-lg leading-8">
          دەربارەی CBC News پلاتفۆرمی هەواڵی دیجیتاڵە کە بە پێویستی بەرزترین
          ستانداردەکانی ژورنالیستی کار دەکات بۆ پێشکەشکردنی هەواڵی دروست،
          بێ‌لایەن و گشتی. کارەکانمان بە ئەو ڕێنماییە ڕێنراون کە هەر ڕاپۆرتێک بە
          وردی توێژینەوە بکرێت، بە سەرچاوەی بەرپرسیار بێت و بە ڕوونی و کۆنتێکست
          پێشکەش بکرێت. ئێمە ڕێکخستنی گەورەی بابەتەکان دەکەین — لە ژێرەوەی
          کارەکانی ناوخۆ، ڕووداوە جیهانیەکان، بازرگانی، تەکنەلۆجی، کەلتور و
          سیاسەتی گشتی — بە ئامانجی ئەوەی بینەرەکانمان ئاگادار بکەین لەسەر
          بابەتە گرنگەکان کە ژیانیان شێوە دەدات. تیمی دەستکاریکردنی ئێمە بە
          بەردەوامی بە ڕوونی، دادپەروەری و بەرپرسیاری کار دەکات لە هەموو
          بوارەکانی ڕاپۆرتکردن. لە CBC News، ئێمە بەو ڕۆڵە گرنگە دەزانین کە
          ژورنالیستی دروست لە ناوەڕاستی گۆڕانی زانیارییەکاندا هەیە. ئامانجمان
          ئەوەیە بینەرەکانمان بە هەواڵی بەرچاو، توێژینەوەی ورد و ڕوونکردنەوەی
          سەرچاوەی دروست پێشکەش بکەین بۆ ئەوەی تەنها نەزانن چی ڕوودەدات، بەڵکو
          بزانن بۆچی گرنگە. ئامانجمان سادەیە: خزمەتکردن بە بەرژەوەندی گشتی بە
          پێشکەشکردنی زانیارییە دروستەکان کە یارمەتیدەری بڕیاردانی ئاگادار و
          هەڵکەوتی گفتوگۆی گرنگ دەبێت. CBC News — بەستە بە ڕاستی، دروستی و
          ئاخلاقی ژورنالیستی.
        </h1>
      </div>

      <div className="col-span-2 my-10 flex justify-center items-center">
        <img src={icon} alt="icon" className="w-70 h-60 hidden lg:block" />
      </div>
    </div>
  );
}
